[
{
    "id": 1,
    "title": "Aplicacion movil (DirtyJeans)",
    "image":"/DirtyJeans.webp",
    "images": ["/DirtyJeans.webp"],
    "shortDescription": "Aplicacion movil , creada para darle solucion a una fabrica de jeans en relacion a los pagos de sus empleados",
    "longDescription": " ",
    "demoLink": "[LINK_A_TU_DEMO_1]",
    "githubLink": "[LINK_A_TU_GITHUB_1]",
    "technologies": ["React", "JavaScript", "PostgreSQL","TypeScript"] 
},
{
    "id": 2,
    "title": "Sistema de Gestion de Reservistas Militares (SIGEPER)",
    "image": "/Sigeper.webp",
    "images":["Sigeper.webp"],
    "shortDescription":["Proyecto enfocado en solucionar la gestión manual y dispersa de la Reserva Militar. ",
                        "Desarrollamos SIGEPER, un sistema web centralizado para registrar, actualizar y consultar el historial completo del personal. ",
                        "El proyecto se implementó utilizando un stack de Django (Python),PostgreSQL y Bootstrap.",
                        ""],
    "longDescription": "Descripción detallada del buscador de películas...",
    "demoLink": "[LINK_A_TU_DEMO_2]",
    "githubLink": "[LINK_A_TU_GITHUB_2]",
    "technologies": ["Python", "Django" ,"PostgreSQL" , "Bootstrap"]
},
{
    "id": 3,
    "title": "Juego Desarrollado en Godot (CUMBIA ESTELAR)",
    "image":"/CumbiaStar.webp",
    "images": ["/CumbiaStar.webp","/SelectorPlayer.webp","/Tuto.webp", 
    "/StagePartida.webp" , "/Cupon.webp" ,"/GameOver.webp"
],
    "shortDescription": "Juego interactivo en Godot/GDScript El juego incentiva a los clientes a participar para ganar códigos de descuento, los cuales se validan contra una base de datos MySQL y se envían automáticamente por email. ",
    "longDescription": [
    "A petición de la tienda de informática PorUsB, desarrollé una solución de marketing 'Play-to-Win' para fidelizar clientes y generar ventas. ",
    "El proyecto consistió en un videojuego completo hecho en Godot Engine, usando GDScript (similar a Python) para toda la lógica de juego y la interfaz. ",
    "Al alcanzar un puntaje objetivo, el jugador accede a un formulario que se conecta a una base de datos MySQL que gestiona los códigos de descuentos. ",
    "Finalmente, el sistema valida el logro y envía automáticamente el código ganado al email del jugador, cerrando el ciclo de marketing. ",
    "Despues con este codigo se hace valido el descuento obtenido para compras en la tienda. "
],
    "demoLink": "[LINK_A_VIDEO_O_DEMO_CUMBIA]",
    "githubLink": "[LINK_A_TU_GITHUB_CUMBIA]",
    "technologies": ["Godot", "GDScript", "MySQL"]
}
]